Case1_Planar_Wave/system/blockMeshDict
/*----------------*- C++ -*--------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// R = 0.15 m, Lz = 0.35 m
// Central block width = 0.06 m
// Arc radius at 45 deg: R * cos(45) = 0.10606602 m

vertices
(
    // Bottom vertices (z = 0)
    (-0.06 -0.06 0)     // 0
    ( 0.06 -0.06 0)     // 1
    ( 0.06  0.06 0)     // 2
    (-0.06  0.06 0)     // 3

    // Top vertices (z = 0.35)
    (-0.06 -0.06 0.35)  // 4
    ( 0.06 -0.06 0.35)  // 5
    ( 0.06  0.06 0.35)  // 6
    (-0.06  0.06 0.35)  // 7

    // Outer circle bottom vertices (z = 0)
    ( 0.10606602 -0.10606602 0) // 8
    ( 0.10606602  0.10606602 0) // 9
    (-0.10606602  0.10606602 0) // 10
    (-0.10606602 -0.10606602 0) // 11

    // Outer circle top vertices (z = 0.35)
    ( 0.10606602 -0.10606602 0.35) // 12
    ( 0.10606602  0.10606602 0.35) // 13
    (-0.10606602  0.10606602 0.35) // 14
    (-0.10606602 -0.10606602 0.35) // 15
);

blocks
(
    // Central square block
    hex (0 1 2 3 4 5 6 7) (20 20 50) simpleGrading (1 1 1)

    // 4 Outer blocks
    hex (1 8 9 2 5 12 13 6) (15 20 50) simpleGrading (1 1 1)
    hex (2 9 10 3 6 13 14 7) (15 20 50) simpleGrading (1 1 1)
    hex (3 10 11 0 7 14 15 4) (15 20 50) simpleGrading (1 1 1)
    hex (0 11 8 1 4 15 12 5) (15 20 50) simpleGrading (1 1 1)
);

edges
(
    // Bottom arcs
    arc 8 9   ( 0.15  0.0  0)
    arc 9 10  ( 0.0   0.15 0)
    arc 10 11 (-0.15  0.0  0)
    arc 11 8  ( 0.0  -0.15 0)

    // Top arcs
    arc 12 13 ( 0.15  0.0  0.35)
    arc 13 14 ( 0.0   0.15 0.35)
    arc 14 15 (-0.15  0.0  0.35)
    arc 15 12 ( 0.0  -0.15 0.35)
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            // Bottom faces
            (0 3 2 1)
            (1 2 9 8)
            (2 3 10 9)
            (3 0 11 10)
            (0 1 8 11)

            // Outer side faces
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (11 8 12 15)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (5 6 13 12)
            (6 7 14 13)
            (7 4 15 14)
            (4 5 12 15)
        );
    }
);

// ************************************************************************* //